Tekla Open API Reference for Tekla Structures 2025
SymbolInfo Constructor
Overload List
Name | Description
SymbolInfo()
 Creates a new symbol info instance.
SymbolInfo(String, Int32)
 Creates a new symbol info instance.
Top
See Also
Reference
SymbolInfo Class
Tekla.Structures.Drawing Namespace